comp-sci/taocpmac.org
#+TITLE: TAOCPMAC in LaTeX
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2024-06-07T08:02:15-07:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
# Created Friday June  7, 2024 at  8:02AM

* Introduction
:PROPERTIES:
:CUSTOM_ID: h-efc467a0-c443-4dfb-b6b3-9bb97a4612db
:END:

This is just my translation of a bit of Knuth's ~taocpmac.tex~ into
LaTeX. This is no exhaustive, but it should cover a lot.

I think Knuth's style is very personal, in the sense that he came to it
after a lot of deliberation and reasoning about it. Therefore, I do not
think it "translates" well: Knuth's macros and layout are suited for his
writing style (which is idiosyncratic), and therefore does not translate
well to other writing styles.

If you want to use his macros, I would seriously urge you to
reconsider. Instead, you should consider asking yourself, "What
/principles/ led him to these decisions? How can I apply those
principles to guide my typographical style?"

* Page Layout
:PROPERTIES:
:CUSTOM_ID: h-26063e28-b037-428f-8b9a-fefe73f40821
:END:

You can use either the ~geometry~ package, or just copy/paste what Knuth
does. The textwidth is 29pc, the textheight is 45pc.

The paper dimensions are given by the ~\htrimsize~ and ~\vtrimsize~
dimensions (height of 9.25 inches, width of 6.375 inches).

#+begin_src tex
% taocpmac.tex original
% Page layout
\newdimen\pagewidth \newdimen\pageheight \newdimen\ruleht
\hsize=29pc  \vsize=45pc  \maxdepth=2.2pt  \parindent=19pt
\pagewidth=\hsize \pageheight=\vsize \ruleht=.5pt
\abovedisplayskip=6pt plus 3pt minus 1pt
\belowdisplayskip=6pt plus 3pt minus 1pt
\abovedisplayshortskip=0pt plus 3pt
\belowdisplayshortskip=4pt plus 3pt
#+end_src

The easiest way to reproduce this, I think, is something like:

#+begin_src latex
\usepackage[pagewidth=6.375in,
  pageheight=9.25in,
  textwidth=29pc,
  textheight=45pc]{geometry}
#+end_src

