docs/comp-sci/taocpmac.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TAOCPMAC in LaTeX</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">TAOCPMAC in LaTeX</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-efc467a0-c443-4dfb-b6b3-9bb97a4612db">1. Introduction</a></li>
<li><a href="#h-26063e28-b037-428f-8b9a-fefe73f40821">2. Page Layout</a></li>
<li><a href="#h-0867aa6b-4cb8-4482-8fc7-7e427943a486">3. Chapter, Section, Subsection formatting</a>
<ul>
<li><a href="#h-bac92a12-bd8d-4ec2-b466-6f2be5224bad">3.1. LaTeX Code using Titlesec</a></li>
</ul>
</li>
<li><a href="#h-9e2d1b7e-68d0-4dc3-a7e2-38a9adee2270">4. Algorithms</a></li>
<li><a href="#h-507a9a50-3ecd-4d11-aa07-9ab084779d0e">5. MIXAL</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-efc467a0-c443-4dfb-b6b3-9bb97a4612db" class="outline-2">
<h2 id="h-efc467a0-c443-4dfb-b6b3-9bb97a4612db"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-efc467a0-c443-4dfb-b6b3-9bb97a4612db">
<p>
This is just my translation of a bit of Knuth's <code>taocpmac.tex</code> into
LaTeX. This is no exhaustive, but it should cover a lot.
</p>

<p>
I think Knuth's style is very personal, in the sense that he came to it
after a lot of deliberation and reasoning about it. Therefore, I do not
think it "translates" well: Knuth's macros and layout are suited for his
writing style (which is idiosyncratic), and therefore does not translate
well to other writing styles.
</p>

<p>
If you want to use his macros, I would seriously urge you to
reconsider. Instead, you should consider asking yourself, "What
<i>principles</i> led him to these decisions? How can I apply those
principles to guide my typographical style?"
</p>
</div>
</div>
<div id="outline-container-h-26063e28-b037-428f-8b9a-fefe73f40821" class="outline-2">
<h2 id="h-26063e28-b037-428f-8b9a-fefe73f40821"><span class="section-number-2">2.</span> Page Layout</h2>
<div class="outline-text-2" id="text-h-26063e28-b037-428f-8b9a-fefe73f40821">
<p>
You can use either the <code>geometry</code> package, or just copy/paste what Knuth
does. The textwidth is 29pc, the textheight is 45pc.
</p>

<p>
The paper dimensions are given by the <code>\htrimsize</code> and <code>\vtrimsize</code>
dimensions (height of 9.25 inches, width of 6.375 inches).
</p>

<div class="org-src-container">
<pre class="src src-tex"><span class="org-comment-delimiter">% </span><span class="org-comment">taocpmac.tex original</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">Page layout</span>
<span class="org-keyword">\newdimen\pagewidth</span> <span class="org-keyword">\newdimen\pageheight</span> <span class="org-keyword">\newdimen\ruleht</span>
<span class="org-keyword">\hsize</span>=29pc  <span class="org-keyword">\vsize</span>=45pc  <span class="org-keyword">\maxdepth</span>=2.2pt  <span class="org-keyword">\parindent</span>=19pt
<span class="org-keyword">\pagewidth</span>=<span class="org-keyword">\hsize</span> <span class="org-keyword">\pageheight</span>=<span class="org-keyword">\vsize</span> <span class="org-keyword">\ruleht</span>=.5pt
<span class="org-keyword">\abovedisplayskip</span>=6pt plus 3pt minus 1pt
<span class="org-keyword">\belowdisplayskip</span>=6pt plus 3pt minus 1pt
<span class="org-keyword">\abovedisplayshortskip</span>=0pt plus 3pt
<span class="org-keyword">\belowdisplayshortskip</span>=4pt plus 3pt
</pre>
</div>

<p>
The easiest way to reproduce this, I think, is something like:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span class="org-keyword">\usepackage</span>[pagewidth=6.375in,
  pageheight=9.25in,
  textwidth=29pc,
  textheight=45pc]{<span class="org-builtin">geometry</span>}
</pre>
</div>
</div>
</div>
