comp-sci/taocpmac.org
* Chapter, Section, Subsection formatting
:PROPERTIES:
:CUSTOM_ID: h-0867aa6b-4cb8-4482-8fc7-7e427943a486
:END:

The tex macros for this is reproduced below:

#+begin_src tex
% taocpmac.tex original

\newif\iftitle \newif\ifdrop \newif\ifrunon
\def\titlepage{\global\titletrue\global\droptrue} % for pages without headlines
\def\lhead{} % running headline on lefthand pages (usually chapter name)
\def\rhead{} % running headline on righthand pages (usually section name)

  
% line 388 et seq.
\def\beginchapter#1: #2.
  {\vfill\eject
    \titlepage
    \leftline{\twelvess \spaceskip=10pt \def\\{\kern1pt}#1}
    \vskip 4pc
    \rightline{\titlefont #2}
    \def\\{}
    \ifx\rhead\omitrhead\else{\ninepoint\xdef\rhead{\uppercase{#2}}}\fi
    \vskip 2pc plus 1 pc minus 1 pc
  }

\def\starred{}
\def\starit{\def\starred{\llap{*}}}
\def\omitrhead{\omit}

\def\beginsection #1. #2.
  {\mark{\currentsection \noexpand\else #1}
    \ifrunon \runonfalse\vskip 1 cm plus 1 pc minus 5 pt
    \else \vfill\eject
      {\output{\setbox0=\box255}\null\vfill\eject} % set \topmark for sure
    \fi
    \tenpoint
    \leftline{\tenssbx\starred#1. \uppercase{#2}}
    \def\starred{}
    \mark{#1\noexpand\else #1}
    \def\currentsection{#1}
    {\ninepoint\xdef\rhead{\uppercase{#2}}}
    \nobreak\smallskip\noindent}

\def\beginsectionnonumber #1.
  {\ifrunon \runonfalse\vskip 1 cm plus 1 pc minus 5 pt
    \else \vfill\eject \fi
    \tenpoint
    \leftline{\tenssbx\starred\uppercase{#1}}
    \def\starred{}
    {\ninepoint\xdef\rhead{\uppercase{#1}}}
    \nobreak\smallskip\noindent}

\def\beginsubsection #1. #2.
  {\mark{\currentsection \noexpand\else #1}
    \bigbreak
    \tenpoint
    \leftline{\tenssbx\starred#1. #2}
    \def\starred{}
    \mark{#1\noexpand\else #1}
    \def\currentsection{#1}
    {\ninepoint\xdef\rhead{\uppercase{#2}}}
    \nobreak\smallskip\noindent}

\def\beginsubsubsection #1. #2.    % set page headers: 3.2.1.3
  {\mark{\currentsection \noexpand\else #1}
    \tenpoint
    \bigbreak
    \null
    \mark{#1\noexpand\else #1}
    \def\currentsection{#1}
    {\ninepoint\xdef\rhead{\uppercase{#2}}}
    \nobreak\vskip-\baselineskip
    \noindent{\bf\starred#1.\enspace #2.\xskip}\def\starred{}\ignorespaces}

\def\beginsubsubsectionprime #1.  % don't set page headers: 3.3.1B
  {\medbreak
    \null
    \tenpoint
    \nobreak\vskip-\baselineskip
    \noindent{\bf\starred#1.\xskip}\def\starred{}\ignorespaces}
#+end_src

A chapter has its chapter number ["CHAPTER 6"] be printed in 12-point
sans serif flushed left, in all capital letters. Then 4pc vskip below
it, flushed right, is the name of the chapter in title font (bold sans
serif, in 14.4 point size). Finally, a vskip of ~2pc plus 1pc minus 1pc~
separates the body text from the chapter section title.

Almost every section in /The Art of Computer Programming/ starts at the
top of a page. I don't know if this is by accident or by design, but
since it's *every* section...that's too much to be a coincidence. (The
only exception I found was section 6.1, but I may be mistaken!)
Section formatting:
- ~\vskip 1 cm plus 1 pc minus 5 pt~ before printing anything (unless on
  the top of the page)
- 10 bold sans serif upper case font
- ~\thesection. #1~ is what is printed
- ~\smallskip~ afterwards, with no indent

Subsections have similar formatting:
- ~\bigbreak~ precedes the title
- 10 bold sans serif font (not upper cases)
- ~\thesubsection. #1~ is what is printed
- ~\nobreak\smallskip\noindent~ is then separating the text

Subsubsections are "runin".
- a ~\bigbreak~ precedes a subsubsection
- Then ~\textbf{\thesubsubsection.\enspace #1.\xskip}\ignorespaces~
  prints the subsubsection number plus its title
- Starred subsubsections do not have subsubsection numbers printed.

There are no levels of organization below subsubsections (there are no
"subsubsubsections", or anything "smaller").

