docs/comp-sci/taocpmac.html
<div id="outline-container-h-0867aa6b-4cb8-4482-8fc7-7e427943a486" class="outline-2">
<h2 id="h-0867aa6b-4cb8-4482-8fc7-7e427943a486"><span class="section-number-2">3.</span> Chapter, Section, Subsection formatting</h2>
<div class="outline-text-2" id="text-h-0867aa6b-4cb8-4482-8fc7-7e427943a486">
<p>
The tex macros for this is reproduced below:
</p>

<div class="org-src-container">
<pre class="src src-tex"><span class="org-comment-delimiter">% </span><span class="org-comment">taocpmac.tex original</span>

<span class="org-keyword">\newif\iftitle</span> <span class="org-keyword">\newif\ifdrop</span> <span class="org-keyword">\newif\ifrunon</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">titlepage</span>{<span class="org-keyword">\global\titletrue\global\droptrue</span>} <span class="org-comment">% for pages without headlines</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">lhead</span>{} <span class="org-comment">% running headline on lefthand pages (usually chapter name)</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">rhead</span>{} <span class="org-comment">% running headline on righthand pages (usually section name)</span>

  
<span class="org-comment-delimiter">% </span><span class="org-comment">line 388 et seq.</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">beginchapter</span>#1: #2.
  {<span class="org-keyword">\vfill\eject</span>
    <span class="org-keyword">\titlepage</span>
    <span class="org-keyword">\leftline</span>{<span class="org-keyword">\twelvess</span> <span class="org-keyword">\spaceskip</span>=10pt <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\kern</span>1pt}#1}
    <span class="org-keyword">\vskip</span> 4pc
    <span class="org-keyword">\rightline</span>{<span class="org-keyword">\titlefont</span> #2}
    <span class="org-keyword">\def</span><span class="org-warning">\\</span>{}
    <span class="org-keyword">\ifx\rhead\omitrhead\else</span>{<span class="org-keyword">\ninepoint\xdef\rhead</span>{<span class="org-keyword">\uppercase</span>{#2}}}<span class="org-keyword">\fi</span>
    <span class="org-keyword">\vskip</span> 2pc plus 1 pc minus 1 pc
  }

<span class="org-keyword">\def</span>\<span class="org-function-name">starred</span>{}
<span class="org-keyword">\def</span>\<span class="org-function-name">starit</span>{<span class="org-keyword">\def\starred</span>{<span class="org-keyword">\llap</span>{*}}}
<span class="org-keyword">\def</span>\<span class="org-function-name">omitrhead</span>{<span class="org-keyword">\omit</span>}

<span class="org-keyword">\def</span>\<span class="org-function-name">beginsection</span> #1. #2.
  {<span class="org-keyword">\mark</span>{<span class="org-keyword">\currentsection</span> <span class="org-keyword">\noexpand\else</span> #1}
    <span class="org-keyword">\ifrunon</span> <span class="org-keyword">\runonfalse\vskip</span> 1 cm plus 1 pc minus 5 pt
    <span class="org-keyword">\else</span> <span class="org-keyword">\vfill\eject</span>
      {<span class="org-keyword">\output</span>{<span class="org-keyword">\setbox</span>0=<span class="org-keyword">\box</span>255}<span class="org-keyword">\null\vfill\eject</span>} <span class="org-comment">% set \topmark for sure</span>
    <span class="org-keyword">\fi</span>
    <span class="org-keyword">\tenpoint</span>
    <span class="org-keyword">\leftline</span>{<span class="org-keyword">\tenssbx\starred</span>#1. <span class="org-keyword">\uppercase</span>{#2}}
    <span class="org-keyword">\def</span>\<span class="org-function-name">starred</span>{}
    <span class="org-keyword">\mark</span>{#1<span class="org-keyword">\noexpand\else</span> #1}
    <span class="org-keyword">\def</span>\<span class="org-function-name">currentsection</span>{#1}
    {<span class="org-keyword">\ninepoint\xdef\rhead</span>{<span class="org-keyword">\uppercase</span>{#2}}}
    <span class="org-keyword">\nobreak\smallskip\noindent</span>}

<span class="org-keyword">\def</span>\<span class="org-function-name">beginsectionnonumber</span> #1.
  {<span class="org-keyword">\ifrunon</span> <span class="org-keyword">\runonfalse\vskip</span> 1 cm plus 1 pc minus 5 pt
    <span class="org-keyword">\else</span> <span class="org-keyword">\vfill\eject</span> <span class="org-keyword">\fi</span>
    <span class="org-keyword">\tenpoint</span>
    <span class="org-keyword">\leftline</span>{<span class="org-keyword">\tenssbx\starred\uppercase</span>{#1}}
    <span class="org-keyword">\def</span>\<span class="org-function-name">starred</span>{}
    {<span class="org-keyword">\ninepoint\xdef\rhead</span>{<span class="org-keyword">\uppercase</span>{#1}}}
    <span class="org-keyword">\nobreak\smallskip\noindent</span>}

<span class="org-keyword">\def</span>\<span class="org-function-name">beginsubsection</span> #1. #2.
  {<span class="org-keyword">\mark</span>{<span class="org-keyword">\currentsection</span> <span class="org-keyword">\noexpand\else</span> #1}
    <span class="org-keyword">\bigbreak</span>
    <span class="org-keyword">\tenpoint</span>
    <span class="org-keyword">\leftline</span>{<span class="org-keyword">\tenssbx\starred</span>#1. #2}
    <span class="org-keyword">\def</span>\<span class="org-function-name">starred</span>{}
    <span class="org-keyword">\mark</span>{#1<span class="org-keyword">\noexpand\else</span> #1}
    <span class="org-keyword">\def</span>\<span class="org-function-name">currentsection</span>{#1}
    {<span class="org-keyword">\ninepoint\xdef\rhead</span>{<span class="org-keyword">\uppercase</span>{#2}}}
    <span class="org-keyword">\nobreak\smallskip\noindent</span>}

<span class="org-keyword">\def</span>\<span class="org-function-name">beginsubsubsection</span> #1. #2.    <span class="org-comment">% set page headers: 3.2.1.3</span>
  {<span class="org-keyword">\mark</span>{<span class="org-keyword">\currentsection</span> <span class="org-keyword">\noexpand\else</span> #1}
    <span class="org-keyword">\tenpoint</span>
    <span class="org-keyword">\bigbreak</span>
    <span class="org-keyword">\null</span>
    <span class="org-keyword">\mark</span>{#1<span class="org-keyword">\noexpand\else</span> #1}
    <span class="org-keyword">\def</span>\<span class="org-function-name">currentsection</span>{#1}
    {<span class="org-keyword">\ninepoint\xdef\rhead</span>{<span class="org-keyword">\uppercase</span>{#2}}}
    <span class="org-keyword">\nobreak\vskip</span>-<span class="org-keyword">\baselineskip</span>
    <span class="org-keyword">\noindent</span>{<span class="org-keyword">\bf</span><span class="org-bold"><span class="org-keyword">\starred</span></span><span class="org-bold">#1.</span><span class="org-bold"><span class="org-keyword">\enspace</span></span><span class="org-bold"> #2.</span><span class="org-bold"><span class="org-keyword">\xskip</span></span>}<span class="org-keyword">\def\starred</span>{}<span class="org-keyword">\ignorespaces</span>}

<span class="org-keyword">\def</span>\<span class="org-function-name">beginsubsubsectionprime</span> #1.  <span class="org-comment">% don't set page headers: 3.3.1B</span>
  {<span class="org-keyword">\medbreak</span>
    <span class="org-keyword">\null</span>
    <span class="org-keyword">\tenpoint</span>
    <span class="org-keyword">\nobreak\vskip</span>-<span class="org-keyword">\baselineskip</span>
    <span class="org-keyword">\noindent</span>{<span class="org-keyword">\bf</span><span class="org-bold"><span class="org-keyword">\starred</span></span><span class="org-bold">#1.</span><span class="org-bold"><span class="org-keyword">\xskip</span></span>}<span class="org-keyword">\def\starred</span>{}<span class="org-keyword">\ignorespaces</span>}
</pre>
</div>

<p>
A chapter has its chapter number ["CHAPTER 6"] be printed in 12-point
sans serif flushed left, in all capital letters. Then 4pc vskip below
it, flushed right, is the name of the chapter in title font (bold sans
serif, in 14.4 point size). Finally, a vskip of <code>2pc plus 1pc minus 1pc</code>
separates the body text from the chapter section title.
</p>

<p>
Almost every section in <i>The Art of Computer Programming</i> starts at the
top of a page. I don't know if this is by accident or by design, but
since it's <b>every</b> section&#x2026;that's too much to be a coincidence. (The
only exception I found was section 6.1, but I may be mistaken!)
Section formatting:
</p>
<ul class="org-ul">
<li><code>\vskip 1 cm plus 1 pc minus 5 pt</code> before printing anything (unless on
the top of the page)</li>
<li>10 bold sans serif upper case font</li>
<li><code>\thesection. #1</code> is what is printed</li>
<li><code>\smallskip</code> afterwards, with no indent</li>
</ul>

<p>
Subsections have similar formatting:
</p>
<ul class="org-ul">
<li><code>\bigbreak</code> precedes the title</li>
<li>10 bold sans serif font (not upper cases)</li>
<li><code>\thesubsection. #1</code> is what is printed</li>
<li><code>\nobreak\smallskip\noindent</code> is then separating the text</li>
</ul>

<p>
Subsubsections are "runin".
</p>
<ul class="org-ul">
<li>a <code>\bigbreak</code> precedes a subsubsection</li>
<li>Then <code>\textbf{\thesubsubsection.\enspace #1.\xskip}\ignorespaces</code>
prints the subsubsection number plus its title</li>
<li>Starred subsubsections do not have subsubsection numbers printed.</li>
</ul>

<p>
There are no levels of organization below subsubsections (there are no
"subsubsubsections", or anything "smaller").
</p>
</div>
