comp-sci/taocpmac.org
** LaTeX Code using Titlesec
:PROPERTIES:
:CUSTOM_ID: h-bac92a12-bd8d-4ec2-b466-6f2be5224bad
:END:

Using the ~titlesec~ package, we can format chapters, sections,
subsections, and subsubsections to resemble their counterparts in
/The Art of Computer Programming/ as follows:

#+begin_src latex
\usepackage{titlesec}
\font\titlefont=cmssbx10 scaled\magstep2
\def\starred{}
\def\starit{\def\starred{\llap{*}}}
\usepackage{titlesec}
% "\large" is 12-point when the main font is 10-point
\titleformat{\chapter}[display]
            {\titlefont} % format
            {\large\sffamily\spaceskip=10pt\MakeUppercase{\chaptertitlename} \thechapter} % label
            {4pc} % sep 
            {\filleft\MakeUppercase} % before
\titleformat{name=\chapter,numberless}[display]
            {\titlefont} % format
            {} % label
            {4pc} % sep
            {\filleft} % before

% Use the fact that a normal space is computed using font dimensions
% see: https://tex.stackexchange.com/a/229642/14751
\titleformat{\section}%[block]
            {\bfseries\sffamily} % format
            {\starred\thesection.\def\starred{}} % label
            {2\fontdimen2\font plus\fontdimen3\font minus\fontdimen4\font} % sep
            {\MakeUppercase} % before

\titleformat{\subsection}%[block]
            {\bfseries\sffamily} % format
            {\starred\thesubsection.\def\starred{}} % label
            {2\fontdimen2\font plus\fontdimen3\font minus\fontdimen4\font} % sep
            {} % before

% Runin subsubsections, with a period added (if missing)
\makeatletter
\def\@addpunct#1{%
  \relax\ifhmode
    \ifnum\spacefactor>\@m \else#1\fi
  \fi}
\titleformat{\subsubsection}[runin]
            {\normalfont\bfseries} % format
            {\starred\thesubsubsection.\def\starred{}} % label
            {0.5em} % sep = \enspace
            {} % before
            [\@addpunct{.}]
\makeatother
\newskip\xskipamount
\xskipamount=7pt plus 3pt minus 4pt
\titlespacing*{\chapter}{0pt}{0pt}{2pc plus 1 pc minus 1 pc}
\titlespacing*{\section}{0pt}{1cm plus 1pc minus 5pt}{\smallskipamount}
\titlespacing*{\subsection}{0pt}{\bigskipamount}{\smallskipamount}
\titlespacing*{\subsubsection}{0pt}{\bigskipamount}{\xskipamount\ignorespaces}
\setcounter{secnumdepth}{3}
#+end_src


* Algorithms
:PROPERTIES:
:CUSTOM_ID: h-9e2d1b7e-68d0-4dc3-a7e2-38a9adee2270
:END:

Knuth uses ~\slug~ as his ~\qedsymbol~, so if you want to use some other
symbol...you'll have to update these macros accordingly.

#+begin_src latex
% latex macros
% These macros are borrowed from TAOCPMAC.tex
\newcommand{\slug}{\hbox{\kern1.5pt\vrule width2.5pt height6pt depth1.5pt\kern1.5pt}}
\def\xskip{\hskip 7pt plus 3pt minus 4pt}
\newdimen\algindent
\newif\ifitempar \itempartrue % normally true unless briefly set false
\def\algindentset#1{\setbox0\hbox{{\bf #1.\kern.25em}}\algindent=\wd0\relax}
\def\algbegin #1 #2{\algindentset{#21}\alg #1 #2} % when steps all have 1 digit
\def\aalgbegin #1 #2{\algindentset{#211}\alg #1 #2} % when 10 or more steps
\def\alg#1(#2). {\medbreak % Usage: \algbegin Algorithm A (algname). This...
  \noindent{\bf#1}({\it#2\/}).\xskip\ignorespaces}
\def\algstep#1.{\ifitempar\smallskip\noindent\else\itempartrue
  \hskip-\parindent\fi
  \hbox to\algindent{\bf\hfil #1.\kern.25em}%
  \hangindent=\algindent\hangafter=1\ignorespaces}
% end of borrowed macros

% For Example, with less than 10 steps:
% \algbegin X (Multiplication). blah blah blah blah...
% \algstep X1. [{\it Do stuff\/}] blah blah blah
% \algstep X2. Terminate the algorithm.\quad\slug
#+end_src

Note that Knuth's only control structure is really jumping to other
steps in the algorithm. It appears to me that the role algorithms play
in TAOCP is little more than extended commentary on the MIXAL programs
found in it.

