docs/comp-sci/taocpmac.html
<div id="outline-container-h-bac92a12-bd8d-4ec2-b466-6f2be5224bad" class="outline-3">
<h3 id="h-bac92a12-bd8d-4ec2-b466-6f2be5224bad"><span class="section-number-3">3.1.</span> LaTeX Code using Titlesec</h3>
<div class="outline-text-3" id="text-h-bac92a12-bd8d-4ec2-b466-6f2be5224bad">
<p>
Using the <code>titlesec</code> package, we can format chapters, sections,
subsections, and subsubsections to resemble their counterparts in
<i>The Art of Computer Programming</i> as follows:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span class="org-keyword">\usepackage</span>{<span class="org-builtin">titlesec</span>}
<span class="org-keyword">\font\titlefont</span>=cmssbx10 scaled<span class="org-keyword">\magstep</span>2
<span class="org-keyword">\def</span>\<span class="org-function-name">starred</span>{}
<span class="org-keyword">\def</span>\<span class="org-function-name">starit</span>{<span class="org-keyword">\def\starred</span>{<span class="org-keyword">\llap</span>{*}}}
<span class="org-keyword">\usepackage</span>{<span class="org-builtin">titlesec</span>}
<span class="org-comment-delimiter">% </span><span class="org-comment">"\large" is 12-point when the main font is 10-point</span>
<span class="org-keyword">\titleformat</span>{<span class="org-keyword">\chapter</span>}[display]
            {<span class="org-keyword">\titlefont</span>} <span class="org-comment">% format</span>
            {<span class="org-keyword">\large\sffamily\spaceskip</span>=10pt<span class="org-keyword">\MakeUppercase</span>{<span class="org-keyword">\chaptertitlename</span>} <span class="org-keyword">\thechapter</span>} <span class="org-comment">% label</span>
            {4pc} <span class="org-comment">% sep </span>
            {<span class="org-keyword">\filleft\MakeUppercase</span>} <span class="org-comment">% before</span>
<span class="org-keyword">\titleformat</span>{name=<span class="org-keyword">\chapter</span>,numberless}[display]
            {<span class="org-keyword">\titlefont</span>} <span class="org-comment">% format</span>
            {} <span class="org-comment">% label</span>
            {4pc} <span class="org-comment">% sep</span>
            {<span class="org-keyword">\filleft</span>} <span class="org-comment">% before</span>

<span class="org-comment-delimiter">% </span><span class="org-comment">Use the fact that a normal space is computed using font dimensions</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">see: https://tex.stackexchange.com/a/229642/14751</span>
<span class="org-keyword">\titleformat</span>{<span class="org-keyword">\section</span>}<span class="org-comment">%[block]</span>
            {<span class="org-keyword">\bfseries</span><span class="org-bold"><span class="org-keyword">\sffamily</span></span>} <span class="org-comment">% format</span>
            {<span class="org-keyword">\starred\thesection</span>.<span class="org-keyword">\def\starred</span>{}} <span class="org-comment">% label</span>
            {2<span class="org-keyword">\fontdimen</span>2<span class="org-keyword">\font</span> plus<span class="org-keyword">\fontdimen</span>3<span class="org-keyword">\font</span> minus<span class="org-keyword">\fontdimen</span>4<span class="org-keyword">\font</span>} <span class="org-comment">% sep</span>
            {<span class="org-keyword">\MakeUppercase</span>} <span class="org-comment">% before</span>

<span class="org-keyword">\titleformat</span>{<span class="org-keyword">\subsection</span>}<span class="org-comment">%[block]</span>
            {<span class="org-keyword">\bfseries</span><span class="org-bold"><span class="org-keyword">\sffamily</span></span>} <span class="org-comment">% format</span>
            {<span class="org-keyword">\starred\thesubsection</span>.<span class="org-keyword">\def\starred</span>{}} <span class="org-comment">% label</span>
            {2<span class="org-keyword">\fontdimen</span>2<span class="org-keyword">\font</span> plus<span class="org-keyword">\fontdimen</span>3<span class="org-keyword">\font</span> minus<span class="org-keyword">\fontdimen</span>4<span class="org-keyword">\font</span>} <span class="org-comment">% sep</span>
            {} <span class="org-comment">% before</span>

<span class="org-comment-delimiter">% </span><span class="org-comment">Runin subsubsections, with a period added (if missing)</span>
<span class="org-keyword">\makeatletter</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">@addpunct</span>#1{<span class="org-comment">%</span>
  <span class="org-keyword">\relax\ifhmode</span>
    <span class="org-keyword">\ifnum\spacefactor</span>&gt;<span class="org-keyword">\@m</span> <span class="org-keyword">\else</span>#1<span class="org-keyword">\fi</span>
  <span class="org-keyword">\fi</span>}
<span class="org-keyword">\titleformat</span>{<span class="org-keyword">\subsubsection</span>}[runin]
            {<span class="org-keyword">\normalfont\bfseries</span>} <span class="org-comment">% format</span>
            {<span class="org-keyword">\starred\thesubsubsection</span>.<span class="org-keyword">\def\starred</span>{}} <span class="org-comment">% label</span>
            {0.5em} <span class="org-comment">% sep = \enspace</span>
            {} <span class="org-comment">% before</span>
            [<span class="org-keyword">\@addpunct</span>{.}]
<span class="org-keyword">\makeatother</span>
<span class="org-keyword">\newskip\xskipamount</span>
<span class="org-keyword">\xskipamount</span>=7pt plus 3pt minus 4pt
<span class="org-keyword">\titlespacing*</span>{<span class="org-keyword">\chapter</span>}{0pt}{0pt}{2pc plus 1 pc minus 1 pc}
<span class="org-keyword">\titlespacing*</span>{<span class="org-keyword">\section</span>}{0pt}{1cm plus 1pc minus 5pt}{<span class="org-keyword">\smallskipamount</span>}
<span class="org-keyword">\titlespacing*</span>{<span class="org-keyword">\subsection</span>}{0pt}{<span class="org-keyword">\bigskipamount</span>}{<span class="org-keyword">\smallskipamount</span>}
<span class="org-keyword">\titlespacing*</span>{<span class="org-keyword">\subsubsection</span>}{0pt}{<span class="org-keyword">\bigskipamount</span>}{<span class="org-keyword">\xskipamount\ignorespaces</span>}
<span class="org-keyword">\setcounter</span>{<span class="org-variable-name">secnumdepth</span>}{3}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-h-9e2d1b7e-68d0-4dc3-a7e2-38a9adee2270" class="outline-2">
<h2 id="h-9e2d1b7e-68d0-4dc3-a7e2-38a9adee2270"><span class="section-number-2">4.</span> Algorithms</h2>
<div class="outline-text-2" id="text-h-9e2d1b7e-68d0-4dc3-a7e2-38a9adee2270">
<p>
Knuth uses <code>\slug</code> as his <code>\qedsymbol</code>, so if you want to use some other
symbol&#x2026;you'll have to update these macros accordingly.
</p>

<div class="org-src-container">
<pre class="src src-latex"><span class="org-comment-delimiter">% </span><span class="org-comment">latex macros</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">These macros are borrowed from TAOCPMAC.tex</span>
<span class="org-keyword">\newcommand</span>{<span class="org-function-name">\slug</span>}{<span class="org-keyword">\hbox</span>{<span class="org-keyword">\kern</span>1.5pt<span class="org-keyword">\vrule</span> width2.5pt height6pt depth1.5pt<span class="org-keyword">\kern</span>1.5pt}}
<span class="org-keyword">\def</span>\<span class="org-function-name">xskip</span>{<span class="org-keyword">\hskip</span> 7pt plus 3pt minus 4pt}
<span class="org-keyword">\newdimen\algindent</span>
<span class="org-keyword">\newif\ifitempar</span> <span class="org-keyword">\itempartrue</span> <span class="org-comment">% normally true unless briefly set false</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">algindentset</span>#1{<span class="org-keyword">\setbox</span>0<span class="org-keyword">\hbox</span>{{<span class="org-keyword">\bf</span><span class="org-bold"> #1.</span><span class="org-bold"><span class="org-keyword">\kern</span></span><span class="org-bold">.25em</span>}}<span class="org-keyword">\algindent</span>=<span class="org-keyword">\wd</span>0<span class="org-keyword">\relax</span>}
<span class="org-keyword">\def</span>\<span class="org-function-name">algbegin</span> #1 #2{<span class="org-keyword">\algindentset</span>{#21}<span class="org-keyword">\alg</span> #1 #2} <span class="org-comment">% when steps all have 1 digit</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">aalgbegin</span> #1 #2{<span class="org-keyword">\algindentset</span>{#211}<span class="org-keyword">\alg</span> #1 #2} <span class="org-comment">% when 10 or more steps</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">alg</span>#1(#2). {<span class="org-keyword">\medbreak</span> <span class="org-comment">% Usage: \algbegin Algorithm A (algname). This...</span>
  <span class="org-keyword">\noindent</span>{<span class="org-keyword">\bf</span><span class="org-bold">#1</span>}({<span class="org-keyword">\it</span><span class="org-italic">#2</span><span class="org-italic"><span class="org-keyword">\/</span></span>}).<span class="org-keyword">\xskip\ignorespaces</span>}
<span class="org-keyword">\def</span>\<span class="org-function-name">algstep</span>#1.{<span class="org-keyword">\ifitempar\smallskip\noindent\else\itempartrue</span>
  <span class="org-keyword">\hskip</span>-<span class="org-keyword">\parindent\fi</span>
  <span class="org-keyword">\hbox</span> to<span class="org-keyword">\algindent</span>{<span class="org-keyword">\bf</span><span class="org-bold"><span class="org-keyword">\hfil</span></span><span class="org-bold"> #1.</span><span class="org-bold"><span class="org-keyword">\kern</span></span><span class="org-bold">.25em</span>}<span class="org-comment">%</span>
  <span class="org-keyword">\hangindent</span>=<span class="org-keyword">\algindent\hangafter</span>=1<span class="org-keyword">\ignorespaces</span>}
<span class="org-comment-delimiter">% </span><span class="org-comment">end of borrowed macros</span>

<span class="org-comment-delimiter">% </span><span class="org-comment">For Example, with less than 10 steps:</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">\algbegin X (Multiplication). blah blah blah blah...</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">\algstep X1. [{\it Do stuff\/}] blah blah blah</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">\algstep X2. Terminate the algorithm.\quad\slug</span>
</pre>
</div>

<p>
Note that Knuth's only control structure is really jumping to other
steps in the algorithm. It appears to me that the role algorithms play
in TAOCP is little more than extended commentary on the MIXAL programs
found in it.
</p>
</div>
</div>
