comp-sci/taocpmac.org
* MIXAL
:PROPERTIES:
:CUSTOM_ID: h-507a9a50-3ecd-4d11-aa07-9ab084779d0e
:END:

The assembly code printed in the book is formatted using the ~\mixtwo~,
~\mixthree~, ~\mixfour~, ..., ~\mixsix~ macros. These are plain TeX
tables, so the columns are separated by ~&~ and the end of line needs a
~\cr~ macro.

If I knew the LaTeX ~\begin{list}...\end{list}~ environment better, I
might try translating it. I'm nervous about just translating this as a
~tabular~, because I don't understand it's underlying mechanics well
enough. But you could imagine something like a ~\begin{mixal}[4]...\end{mixal}~
environment taking an optional parameter for the number of columns,
which would be nice.

A few explicit notes worth mentioning:

- ~\underspecial~ is used to underline comments referencing steps in an
  associated algorithm; Knuth breaks the underlining when there is a
  "descender" (like the curly part of a lowercase "g" or "j" or "y")
- ~\small~ is approximately LaTeX counterpart of ~\ninepoint~
- ~\mc~ is for medium caps (as opposed to ~\sc~), and I honestly don't
  know why ~\mc~ is used for these logos instead of ~\sc~ or anything
  else (but after working with Times New Roman font for a while, ~\mc~
  formatting of FORTRAN looks much nicer than ~\textsc{Fortran}~...);
- I have had great difficulty getting these macros to work nicely with
  page breaks in LaTeX, but perhaps I'm just an idiot

#+begin_src tex
% taocpmac.tex lines 876 et seq.
\def\CEE/{{\mc C\spacefactor1000}}% the C programming language
\def\FORTRAN/{{\mc FORTRAN\spacefactor1000}}% ditto for the older guy
\def\ALGOL/{{\mc ALGOL\spacefactor1000}}
\def\COBOL/{{\mc COBOL\spacefactor1000}}
\def\MIX{{\tt MIX\spacefactor1000}}
\def\MMIX{{\tt MMIX\spacefactor1000}}
\def\mm{\kern-.2em\'{}\kern-.1em} % modifies a section number, for MMIX changes
\def\rA{\hbox{\rm rA}}
\def\rX{\hbox{\rm rX}}
\def\rAX{\hbox{\rm rAX}}
\def\rI{\hbox{\rm rI}}
\def\rJ{\hbox{\rm rJ}}

% to typeset assembly code, use:
%  \mixtwo   for opcode and address
%  \mixthree for location, opcode, and address
%  \mixfour  for line number, location, opcode, and address
%  \mixfive  for line number, location, opcode, address, count
%  \mixsix  for line number, location, opcode, address, count, squeezed tight
% (all variations allow optional comments at end of the line)
% put \\ after \cr to indicate a logical page break
% and end the whole thing with \endmix

% Say \let\ninepoint=\flexninepoint to allow slight baselineskip variations

\def\sdol{\global\catcode`\$=12 \global\catcode`\#=12}
\def\ndol{\global\catcode`\$=3  \global\catcode`\#=6}
\def\specialunder{\ifmmode\def\next{_}\else\chardef\next=`\_\fi\next}
{\catcode`\_=\active
  \gdef\underspecial{\catcode`\_\active \global\let_=\specialunder}}
\def\mixtwo{\begingroup\let\ttt=\tt \ninepoint
  \def\\{\noalign{\penalty-200}}
  \halign\bgroup
          \ttt\hbox to 2.5em{##\hfil}& % op
          \ttt##\hfil\quad&            % address
          \rm##\hfil\cr}               % comment
\def\mmixtwo{\begingroup\let\ttt=\tt\ninepoint \underspecial
  \def\\{\noalign{\penalty-200}}
  \halign\bgroup
          \ttt##\hfil\quad\sdol&       % op
          \ttt##\hfil\quad\ndol&       % expr
          \rm##\hfil\cr}               % comment
\def\mixthree{\begingroup\let\ttt=\tt\ninepoint
  \def\\{\noalign{\penalty-200}}
  \halign\bgroup
          \ttt##\enspace\hfil&         % loc
          \ttt\hbox to 2.5em{##\hfil}& % op
          \ttt##\hfil\quad&            % address
          \rm##\hfil\cr}               % comment
\def\mmixthree{\begingroup\let\ttt=\tt\ninepoint
  \def\\{\noalign{\penalty-200}}
  \halign\bgroup
          \ttt##\enspace\hfil&         % label
          \ttt##\hfil\ \sdol&          % op
          \ttt##\hfil\quad\ndol&       % expr
          \rm##\hfil\cr}               % comment
\def\mixfour{\begingroup\let\ttt=\tt\ninepoint
  \def\\{\noalign{\penalty-200}}
  \halign\bgroup
          \hfil\it##\quad&             % line
          \ttt##\enspace\hfil&         % loc
          \ttt\hbox to 2.5em{##\hfil}& % op
          \ttt##\hfil\quad&            % address
          \rm##\hfil\cr}               % comment
\def\mmixfour{\begingroup\let\ttt=\tt\ninepoint \underspecial
  \def\\{\noalign{\penalty-200}}
  \halign\bgroup
          \hfil\it##\quad\sdol&        % line
          \ttt##\enspace\hfil&         % label
          \ttt##\hfil\enspace&         % op
          \ttt##\hfil\quad\ndol&       % expr
          \rm##\hfil\cr}               % comment
\def\mixfive{\begingroup\let\ttt=\tt\ninepoint
  \def\\{\noalign{\penalty-200}}
  \halign\bgroup
          \hfil\it##\quad&             % line
          \ttt##\enspace\hfil&         % loc
          \ttt\hbox to 2.5em{##\hfil}& % op
          \ttt##\hfil\quad&            % address
          \hfil$ ##$\hfil\quad&        % frequency count
          \rm##\hfil\cr}               % comment
\def\mmixfive{\begingroup\let\ttt=\tt\ninepoint \underspecial
  \def\\{\noalign{\penalty-200}}
  \halign\bgroup
          \hfil\it##\quad\sdol&        % line
          \ttt##\enspace\hfil&         % label
          \ttt##\hfil\enspace&         % op
          \ttt##\hfil\quad\ndol&       % expr
          \hfil$ ##$\hfil\quad&        % frequency count
          \rm##\hfil\cr}               % comment
\newdimen\mixsqueeze % set this before each use of \mixsix
\def\mixsix{\begingroup\let\ttt=\tt\ninepoint %last field is flush right
  \def\\{\noalign{\penalty-200}}
  \halign to \hsize\bgroup
          \hfil\it##\quad&             % line
          \ttt##\enspace\hfil&         % loc
          \ttt\hbox to 2.5em{##\hfil}& % op
          \ttt##\hfil\quad&            % address
          \hskip-\mixsqueeze
          \hfil$ ##$\hfil\quad&        % frequency count
          \rm##\hidewidth\tabskip 0pt plus 1fil& % comment
          \medmuskip 1mu \relax \thickmuskip 3mu \relax
          \hfil##\tabskip0pt\cr}
\def\endmix{\egroup\endgroup}
\def\endmmix{\egroup\endgroup}
#+end_src
