docs/comp-sci/taocpmac.html
<div id="outline-container-h-507a9a50-3ecd-4d11-aa07-9ab084779d0e" class="outline-2">
<h2 id="h-507a9a50-3ecd-4d11-aa07-9ab084779d0e"><span class="section-number-2">5.</span> MIXAL</h2>
<div class="outline-text-2" id="text-h-507a9a50-3ecd-4d11-aa07-9ab084779d0e">
<p>
The assembly code printed in the book is formatted using the <code>\mixtwo</code>,
<code>\mixthree</code>, <code>\mixfour</code>, &#x2026;, <code>\mixsix</code> macros. These are plain TeX
tables, so the columns are separated by <code>&amp;</code> and the end of line needs a
<code>\cr</code> macro.
</p>

<p>
If I knew the LaTeX <code>\begin{list}...\end{list}</code> environment better, I
might try translating it. I'm nervous about just translating this as a
<code>tabular</code>, because I don't understand it's underlying mechanics well
enough. But you could imagine something like a <code>\begin{mixal}[4]...\end{mixal}</code>
environment taking an optional parameter for the number of columns,
which would be nice.
</p>

<p>
A few explicit notes worth mentioning:
</p>

<ul class="org-ul">
<li><code>\underspecial</code> is used to underline comments referencing steps in an
associated algorithm; Knuth breaks the underlining when there is a
"descender" (like the curly part of a lowercase "g" or "j" or "y")</li>
<li><code>\small</code> is approximately LaTeX counterpart of <code>\ninepoint</code></li>
<li><code>\mc</code> is for medium caps (as opposed to <code>\sc</code>), and I honestly don't
know why <code>\mc</code> is used for these logos instead of <code>\sc</code> or anything
else (but after working with Times New Roman font for a while, <code>\mc</code>
formatting of FORTRAN looks much nicer than <code>\textsc{Fortran}</code>&#x2026;);</li>
<li>I have had great difficulty getting these macros to work nicely with
page breaks in LaTeX, but perhaps I'm just an idiot</li>
</ul>

<div class="org-src-container">
<pre class="src src-tex"><span class="org-comment-delimiter">% </span><span class="org-comment">taocpmac.tex lines 876 et seq.</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">CEE</span>/{{<span class="org-keyword">\mc</span> C<span class="org-keyword">\spacefactor</span>1000}}<span class="org-comment">% the C programming language</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">FORTRAN</span>/{{<span class="org-keyword">\mc</span> FORTRAN<span class="org-keyword">\spacefactor</span>1000}}<span class="org-comment">% ditto for the older guy</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">ALGOL</span>/{{<span class="org-keyword">\mc</span> ALGOL<span class="org-keyword">\spacefactor</span>1000}}
<span class="org-keyword">\def</span>\<span class="org-function-name">COBOL</span>/{{<span class="org-keyword">\mc</span> COBOL<span class="org-keyword">\spacefactor</span>1000}}
<span class="org-keyword">\def</span>\<span class="org-function-name">MIX</span>{{<span class="org-keyword">\tt</span> MIX<span class="org-keyword">\spacefactor</span>1000}}
<span class="org-keyword">\def</span>\<span class="org-function-name">MMIX</span>{{<span class="org-keyword">\tt</span> MMIX<span class="org-keyword">\spacefactor</span>1000}}
<span class="org-keyword">\def</span>\<span class="org-function-name">mm</span>{<span class="org-keyword">\kern</span>-.2em<span class="org-keyword">\'</span>{}<span class="org-keyword">\kern</span>-.1em} <span class="org-comment">% modifies a section number, for MMIX changes</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">rA</span>{<span class="org-keyword">\hbox</span>{<span class="org-keyword">\rm</span> rA}}
<span class="org-keyword">\def</span>\<span class="org-function-name">rX</span>{<span class="org-keyword">\hbox</span>{<span class="org-keyword">\rm</span> rX}}
<span class="org-keyword">\def</span>\<span class="org-function-name">rAX</span>{<span class="org-keyword">\hbox</span>{<span class="org-keyword">\rm</span> rAX}}
<span class="org-keyword">\def</span>\<span class="org-function-name">rI</span>{<span class="org-keyword">\hbox</span>{<span class="org-keyword">\rm</span> rI}}
<span class="org-keyword">\def</span>\<span class="org-function-name">rJ</span>{<span class="org-keyword">\hbox</span>{<span class="org-keyword">\rm</span> rJ}}

<span class="org-comment-delimiter">% </span><span class="org-comment">to typeset assembly code, use:</span>
<span class="org-comment-delimiter">%  </span><span class="org-comment">\mixtwo   for opcode and address</span>
<span class="org-comment-delimiter">%  </span><span class="org-comment">\mixthree for location, opcode, and address</span>
<span class="org-comment-delimiter">%  </span><span class="org-comment">\mixfour  for line number, location, opcode, and address</span>
<span class="org-comment-delimiter">%  </span><span class="org-comment">\mixfive  for line number, location, opcode, address, count</span>
<span class="org-comment-delimiter">%  </span><span class="org-comment">\mixsix  for line number, location, opcode, address, count, squeezed tight</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">(all variations allow optional comments at end of the line)</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">put \\ after \cr to indicate a logical page break</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">and end the whole thing with \endmix</span>

<span class="org-comment-delimiter">% </span><span class="org-comment">Say \let\ninepoint=\flexninepoint to allow slight baselineskip variations</span>

<span class="org-keyword">\def</span>\<span class="org-function-name">sdol</span>{<span class="org-keyword">\global\catcode</span>`<span class="org-keyword">\$</span>=12 <span class="org-keyword">\global\catcode</span>`<span class="org-keyword">\#</span>=12}
<span class="org-keyword">\def</span>\<span class="org-function-name">ndol</span>{<span class="org-keyword">\global\catcode</span>`<span class="org-keyword">\$</span>=3  <span class="org-keyword">\global\catcode</span>`<span class="org-keyword">\#</span>=6}
<span class="org-keyword">\def</span>\<span class="org-function-name">specialunder</span>{<span class="org-keyword">\ifmmode\def\next</span>{_}<span class="org-keyword">\else\chardef\next</span>=`<span class="org-keyword">\_\fi\next</span>}
{<span class="org-keyword">\catcode</span>`<span class="org-keyword">\_</span>=<span class="org-keyword">\active</span>
  <span class="org-keyword">\gdef\underspecial</span>{<span class="org-keyword">\catcode</span>`<span class="org-keyword">\_\active</span> <span class="org-keyword">\global\let</span>_=<span class="org-keyword">\specialunder</span>}}
<span class="org-keyword">\def</span>\<span class="org-function-name">mixtwo</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt</span> <span class="org-keyword">\ninepoint</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign\bgroup</span>
          <span class="org-keyword">\ttt\hbox</span> to 2.5em{##<span class="org-keyword">\hfil</span>}&amp; <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad</span>&amp;            <span class="org-comment">% address</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hfil\cr</span>}               <span class="org-comment">% comment</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">mmixtwo</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt\ninepoint</span> <span class="org-keyword">\underspecial</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign\bgroup</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad\sdol</span>&amp;       <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad\ndol</span>&amp;       <span class="org-comment">% expr</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hfil\cr</span>}               <span class="org-comment">% comment</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">mixthree</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt\ninepoint</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign\bgroup</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\enspace\hfil</span>&amp;         <span class="org-comment">% loc</span>
          <span class="org-keyword">\ttt\hbox</span> to 2.5em{##<span class="org-keyword">\hfil</span>}&amp; <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad</span>&amp;            <span class="org-comment">% address</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hfil\cr</span>}               <span class="org-comment">% comment</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">mmixthree</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt\ninepoint</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign\bgroup</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\enspace\hfil</span>&amp;         <span class="org-comment">% label</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil</span>\ <span class="org-keyword">\sdol</span>&amp;          <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad\ndol</span>&amp;       <span class="org-comment">% expr</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hfil\cr</span>}               <span class="org-comment">% comment</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">mixfour</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt\ninepoint</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign\bgroup</span>
          <span class="org-keyword">\hfil\it</span><span class="org-italic">##</span><span class="org-italic"><span class="org-keyword">\quad</span></span>&amp;             <span class="org-comment">% line</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\enspace\hfil</span>&amp;         <span class="org-comment">% loc</span>
          <span class="org-keyword">\ttt\hbox</span> to 2.5em{##<span class="org-keyword">\hfil</span>}&amp; <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad</span>&amp;            <span class="org-comment">% address</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hfil\cr</span>}               <span class="org-comment">% comment</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">mmixfour</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt\ninepoint</span> <span class="org-keyword">\underspecial</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign\bgroup</span>
          <span class="org-keyword">\hfil\it</span><span class="org-italic">##</span><span class="org-italic"><span class="org-keyword">\quad\sdol</span></span>&amp;        <span class="org-comment">% line</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\enspace\hfil</span>&amp;         <span class="org-comment">% label</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\enspace</span>&amp;         <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad\ndol</span>&amp;       <span class="org-comment">% expr</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hfil\cr</span>}               <span class="org-comment">% comment</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">mixfive</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt\ninepoint</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign\bgroup</span>
          <span class="org-keyword">\hfil\it</span><span class="org-italic">##</span><span class="org-italic"><span class="org-keyword">\quad</span></span>&amp;             <span class="org-comment">% line</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\enspace\hfil</span>&amp;         <span class="org-comment">% loc</span>
          <span class="org-keyword">\ttt\hbox</span> to 2.5em{##<span class="org-keyword">\hfil</span>}&amp; <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad</span>&amp;            <span class="org-comment">% address</span>
          <span class="org-keyword">\hfil</span><span class="org-tex-math">$ ##$</span><span class="org-keyword">\hfil\quad</span>&amp;        <span class="org-comment">% frequency count</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hfil\cr</span>}               <span class="org-comment">% comment</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">mmixfive</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt\ninepoint</span> <span class="org-keyword">\underspecial</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign\bgroup</span>
          <span class="org-keyword">\hfil\it</span><span class="org-italic">##</span><span class="org-italic"><span class="org-keyword">\quad\sdol</span></span>&amp;        <span class="org-comment">% line</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\enspace\hfil</span>&amp;         <span class="org-comment">% label</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\enspace</span>&amp;         <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad\ndol</span>&amp;       <span class="org-comment">% expr</span>
          <span class="org-keyword">\hfil</span><span class="org-tex-math">$ ##$</span><span class="org-keyword">\hfil\quad</span>&amp;        <span class="org-comment">% frequency count</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hfil\cr</span>}               <span class="org-comment">% comment</span>
<span class="org-keyword">\newdimen\mixsqueeze</span> <span class="org-comment">% set this before each use of \mixsix</span>
<span class="org-keyword">\def</span>\<span class="org-function-name">mixsix</span>{<span class="org-keyword">\begingroup\let\ttt</span>=<span class="org-keyword">\tt\ninepoint</span> <span class="org-comment">%last field is flush right</span>
  <span class="org-keyword">\def</span><span class="org-warning">\\</span>{<span class="org-keyword">\noalign</span>{<span class="org-keyword">\penalty</span>-200}}
  <span class="org-keyword">\halign</span> to <span class="org-keyword">\hsize\bgroup</span>
          <span class="org-keyword">\hfil\it</span><span class="org-italic">##</span><span class="org-italic"><span class="org-keyword">\quad</span></span>&amp;             <span class="org-comment">% line</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\enspace\hfil</span>&amp;         <span class="org-comment">% loc</span>
          <span class="org-keyword">\ttt\hbox</span> to 2.5em{##<span class="org-keyword">\hfil</span>}&amp; <span class="org-comment">% op</span>
          <span class="org-keyword">\ttt</span>##<span class="org-keyword">\hfil\quad</span>&amp;            <span class="org-comment">% address</span>
          <span class="org-keyword">\hskip</span>-<span class="org-keyword">\mixsqueeze</span>
          <span class="org-keyword">\hfil</span><span class="org-tex-math">$ ##$</span><span class="org-keyword">\hfil\quad</span>&amp;        <span class="org-comment">% frequency count</span>
          <span class="org-keyword">\rm</span>##<span class="org-keyword">\hidewidth\tabskip</span> 0pt plus 1fil&amp; <span class="org-comment">% comment</span>
          <span class="org-keyword">\medmuskip</span> 1mu <span class="org-keyword">\relax</span> <span class="org-keyword">\thickmuskip</span> 3mu <span class="org-keyword">\relax</span>
          <span class="org-keyword">\hfil</span>##<span class="org-keyword">\tabskip</span>0pt<span class="org-keyword">\cr</span>}
<span class="org-keyword">\def</span>\<span class="org-function-name">endmix</span>{<span class="org-keyword">\egroup\endgroup</span>}
<span class="org-keyword">\def</span>\<span class="org-function-name">endmmix</span>{<span class="org-keyword">\egroup\endgroup</span>}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Wed, 12 Jun 2024 11:24:18 -0700
</div>
</body>
</html>
